app/controllers/departamentos_controller.rb

  def index
    @departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"